#### Label Encoding

###### Label encoding involves assigning a unique numerical label to each category in the variable.

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame({
  'color':['red','blue','green','green','red','blue']
})

In [4]:
df.head()

   color
0    red
1   blue
2  green
3  green
4    red

In [5]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder=LabelEncoder()

In [6]:
lbl_encoder.fit_transform(df[['color']])

c:\Users\LENOVO\anaconda3\Lib\site-packages\sklearn\preprocessing\_label.py:114: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 1, 2, 0])

In [7]:
lbl_encoder.transform([['red']])

c:\Users\LENOVO\anaconda3\Lib\site-packages\sklearn\preprocessing\_label.py:132: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [8]:
lbl_encoder.transform([['green']])

c:\Users\LENOVO\anaconda3\Lib\site-packages\sklearn\preprocessing\_label.py:132: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([1])

In [9]:
lbl_encoder.transform([['blue']])

c:\Users\LENOVO\anaconda3\Lib\site-packages\sklearn\preprocessing\_label.py:132: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([0])

#### We cannot say which is greater it directly give the numerical values

## Ordinal Encoding

#### It used to encode Categorical data that have an intrinsic order or ranking.

In [10]:
## ordinal Encoding...
from sklearn.preprocessing import OrdinalEncoder

In [11]:
df=pd.DataFrame({
  'size':['small','medium','large','medium','small','large']
})

In [12]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [13]:
## Create an instance of ordinalEncoder and then fit_transform
encoder=OrdinalEncoder(categories=[['small','medium','large']])

In [14]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [15]:
encoder.transform([['small']])

c:\Users\LENOVO\anaconda3\Lib\site-packages\sklearn\base.py:493: UserWarning: X does not have valid feature names, but OrdinalEncoder was fitted with feature names
  warnings.warn(

array([[0.]])

#### Target Guided Ordinal Encoding

##### It is a technique used to encode categorical variable based on their relationship with the target variable.This encoding technique is usefi=ul when we have categorical variable with a large number of unique Categories.

In [16]:
df=pd.DataFrame({
  'city':['New york','London','Paris','Tokyo','New York','Paris'],
  'price':[200,150,300,250,180,320]
})

In [17]:
df

       city  price
0  New york    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [19]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [20]:
mean_price

{'London': 150.0,
 'New York': 180.0,
 'New york': 200.0,
 'Paris': 310.0,
 'Tokyo': 250.0}

In [21]:
df['city_encoded']=df['city'].map(mean_price)

In [22]:
df

       city  price  city_encoded
0  New york    200         200.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         180.0
5     Paris    320         310.0

In [24]:
df.drop('city',axis=1)

   price  city_encoded
0    200         200.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         180.0
5    320         310.0

In [26]:
import seaborn as sns
df=sns.load_dataset('tips')

In [27]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [35]:
mean_time=df.groupby('time')['total_bill'].mean().to_dict()

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_14420\1858858511.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  mean_time=df.groupby('time')['total_bill'].mean().to_dict()

In [36]:
mean_time

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [37]:
df['time_encoded']=df['time'].map(mean_time)

In [39]:
df.drop('time',axis=1)

     total_bill   tip     sex smoker   day  size time_encoded
0         16.99  1.01  Female     No   Sun     2    20.797159
1         10.34  1.66    Male     No   Sun     3    20.797159
2         21.01  3.50    Male     No   Sun     3    20.797159
3         23.68  3.31    Male     No   Sun     2    20.797159
4         24.59  3.61  Female     No   Sun     4    20.797159
..          ...   ...     ...    ...   ...   ...          ...
239       29.03  5.92    Male     No   Sat     3    20.797159
240       27.18  2.00  Female    Yes   Sat     2    20.797159
241       22.67  2.00    Male    Yes   Sat     2    20.797159
242       17.82  1.75    Male     No   Sat     2    20.797159
243       18.78  3.00  Female     No  Thur     2    20.797159

[244 rows x 7 columns]